2026/ROSS_AAA/AAA_M_80+_stat_2_prob_distribution_parabolic_morph_2/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-45.492721 -25.516176 -62.519654)
    (81.878553 -25.516176 -62.519654)
    (81.878553 156.693241 -62.519654)
    (-45.492721 156.693241 -62.519654)
    (-45.492721 -25.516176 66.182217)
    (81.878553 -25.516176 66.182217)
    (81.878553 156.693241 66.182217)
    (-45.492721 156.693241 66.182217)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (255 365 258) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    world
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
