2026/ROSS_AAA/AAA_M_80+_stat_2_prob_distribution_parabolic_morph_2/system/surfaceFeaturesDict
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          surfaceFeatureExtractDict;
}

surfaces
(
    "inlet.stl"
    "outlet.stl"
    "wall.stl"
);

includedAngle   150;


